backend/app/controllers/admin/users_controller.rb

    def create
      authorize User, policy_class: Admin::UserPolicy
      user = User.new(user_params)

      if user.save
        render_success({ user: admin_user_json(user) }, :created)
      else
        render_error(user.errors.full_messages.join(", "))
---
SELECT "users".* FROM "users"