backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def authenticate_user!
    token = request.headers["Authorization"]&.split(" ")&.last

    if token
      # Verify JWT signature and decode - will raise JWT::DecodeError if invalid
      decoded = JWT.decode(token, Rails.application.secret_key_base, true, algorithm: "HS256")
      # Always fetch fresh user data from DB - ensures admin status is current
      @current_user = User.find(decoded[0]["sub"])