backend/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@thanx.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email]&.downcase)