backend/app/controllers/redemptions_controller.rb

SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" IN (?, ?)  [["id", 2], ["id", 1]]
---
  def index
    redemptions = policy_scope(Redemption).includes(:reward).order(created_at: :desc)