backend/app/controllers/redemptions_controller.rb

SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ?  [["id", 2]]
---
  def index
    redemptions = policy_scope(Redemption).includes(:reward).order(created_at: :desc)
    redemptions = redemptions.where(user_id: params[:user_id]) if params[:user_id].present?