backend/app/controllers/rewards_controller.rb

  def index
    rewards = Reward.all
---
SELECT "rewards".* FROM "rewards"