backend/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "admin", "points_balance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"