backend/app/services/rewards/redeemer.rb

SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "redemptions" ("user_id", "reward_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["reward_id", 2], ["created_at", "2025-07-14 07:14:53.284979"], ["updated_at", "2025-07-14 07:14:53.284979"]]
---
    def call
      # Lock user record to ensure atomic check-and-deduct operation
      @user.with_lock do
        reward = Reward.find_by(id: @reward_id)
        raise RewardNotFoundError, "Reward not found" unless reward

        unless @user.can_afford?(reward)
          raise InsufficientPointsError, "Insufficient points to redeem this reward"
        end

        # Deduct points and create redemption in same transaction
        @user.deduct_points!(reward.cost)
        redemption = @user.redemptions.create!(reward: reward)